In [55]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [56]:
dataset = pd.read_csv('train.csv')

In [57]:

dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [58]:
dataset = dataset[['Pclass','Sex','Age','SibSp','Parch','Survived']]

In [59]:
dataset.head()

   Pclass     Sex   Age  SibSp  Parch  Survived
0       3    male  22.0      1      0         0
1       1  female  38.0      1      0         1
2       3  female  26.0      0      0         1
3       1  female  35.0      1      0         1
4       3    male  35.0      0      0         0

In [60]:
dataset['Sex'] = dataset['Sex'].map({'male':0,'female':1})

C:\Users\navee\AppData\Local\Temp/ipykernel_5116/3911379993.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataset['Sex'] = dataset['Sex'].map({'male':0,'female':1})

In [61]:
dataset.head()

   Pclass  Sex   Age  SibSp  Parch  Survived
0       3    0  22.0      1      0         0
1       1    1  38.0      1      0         1
2       3    1  26.0      0      0         1
3       1    1  35.0      1      0         1
4       3    0  35.0      0      0         0

In [62]:
nu = dataset.isna().sum(axis=0)

In [63]:
nu

Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Survived      0
dtype: int64

In [64]:
dataset  = dataset.dropna()

In [65]:
X = dataset.iloc[:,:-1].values
y = dataset.iloc[:,-1].values

In [66]:
from sklearn.model_selection import train_test_split

X_train, X_test,y_train, y_test = train_test_split(X,y,test_size=0.2,random_state=0)

In [67]:
from sklearn.tree import DecisionTreeClassifier
decision = DecisionTreeClassifier()
decision.fit(X_train,y_train)

DecisionTreeClassifier()

In [71]:
y_pred = decision.predict(X_test)

In [73]:
from sklearn.metrics import accuracy_score
score = accuracy_score(y_pred,y_test)

In [75]:
print("score : ",score*100)

score :  76.92307692307693

In [79]:
from sklearn.metrics import confusion_matrix
c_matrix = pd.DataFrame(
    confusion_matrix(y_test,y_pred),
    columns = ['Actual True','Actual False'],
    index = ["pred_true","pred_false"]
)

In [80]:
c_matrix

            Actual True  Actual False
pred_true            66            13
pred_false           20            44

In [93]:
TruePositive = 0
TrueNegative = 0
FalsePositive = 0
FalseNegative = 0
for i in range(143):
    if y_test[i] == 1 and y_test[i]==y_pred[i]:
        TrueNegative +=1
    if y_test[i] == 0 and y_test[i]==y_pred[i]:
        TruePositive += 1
    if y_test[i] == 1 and y_pred[i]== 0:
        FalseNegative +=1
    if y_test[i] == 0 and y_pred[i]== 1:
        FalsePositive +=1
        
print("TruePositive : ",TruePositive,'\n',"TrueNegative : ",TrueNegative,'\n',"FalsePositive : ",FalsePositive,'\n',"FalseNegative : ",FalseNegative)

TruePositive :  66
 TrueNegative :  44
 FalsePositive :  13
 FalseNegative :  20

In [94]:
# sensitivity : # when True Positive cases are Important (or) RECALL

sensitivity = TruePositive /(TruePositive +FalseNegative )

sensitivity

0.7674418604651163

In [95]:
# Specificity : # when True Negative cases are Important

Specificity = TrueNegative  /(TrueNegative  +FalsePositive  )

Specificity

0.7719298245614035

In [96]:
# Precision : 

Precision = TruePositive /(TruePositive +FalsePositive)
Precision

0.8354430379746836

In [97]:
# balanced Accracy : mean of sensitivity,Specificity

balanced_Accracy = (sensitivity + Specificity)/2

balanced_Accracy

0.7696858425132599